[
  {
    "text": "As a proud veteran of the USMC, I strongly support net neutrality backed by Title 2 oversight of ISPs. Corporations should have no right to restrict or favor any internet traffic over another. In contrast to the lies of Ajit Pai we have seen corporations such as Verizon, Comcast and others attempt to do just that prior to the previous net neutrality laws (which did not go far enough to protect the internet). Please do what we we elected you to do and represent the American people in this and not lobbyists for corporations. We will be watching how you vote.",
    "source": "Eldon Alameda",
    "link": "vets"
  },
  {
    "text": "This is a travesty. The internet has become something bigger then any company or ISP. It needs to be labeled a public utility and protected via Net Neutrality Law and a removal of Data Caps and Throttling",
    "source": "Gleb R, Paramedic",
    "link": "fr"
  },
  {
    "text": "We are a small property management and real estate company. We specialize in short term vacation rentals and almost all of our business comes from our website and social media pages. The FCC killing net neutrality could put us in a really bad spot and possibly ruin our business. We support the CRA to bring net neutrality back and keep the web open and free for everyone.",
    "source": "Christian Pugh, Beach Tyme Properties",
    "link": "biz"
  },
  {
    "text": "I am a disabled veteran, I use things such as; Facebook and LinkedIn to keep in touch with my battle buddies in North Carolina,please reverse the FCC repeal of net neutrality",
    "source": "Forrest Perez",
    "link": "vets"
  },
  {
    "text": "It was absolutely disgraceful to hear about Verizon throttling our brothers and sisters in California, especially while they were battling wild fires. It is just further proof that ISPs cannot be trusted. They've repeatedly said that they don't need rules, because they would never violate the spirit of net neutrality... And yet, here they go trying to squeeze a few more dollars from firefighters. Give net neutrality the force of law again, so we don't ever have to wonder if these huge corporations are gaming us again. Thank you.",
    "source":"Kyle Marcussen, Firefighter-paramedic",
    "link": "fr"
  },
  {
    "text": "Small Not-For-Profits and Churches will be hurt irreparably if Internet Neutrality is destroyed. We cannot pay for priority service for our website.",
    "source": "Paul Horne, Church of Our Savior MCC",
    "link": "biz"
  },
  {
    "text": "\"Drain the swamp!\"  End political appointment of corporate shills.  (Yes, I'm talking about you, Ajit Pai.)",
    "source": "Glen Neff, Army",
    "link": "vets"
  },
  {
    "text": "It is appalling this happened to first responders, but it really shouldn't happen to anyone really. We need net neutrality back now!",
    "source":"Andrew Przepioski, Paramedic",
    "link": "fr"
  },
  {
    "text": "Net neutrality is ESSENTIAL to the the survival of my small business.",
    "source": "Beth Rontal, Partnership In Wellness",
    "link": "biz"
  },
  {
    "text": "Please don't take away net neutrality. Not being able to use the services of unfettered internet while on deployment will be a nightmare for those deployed and their families.",
    "source": "Thomas Garrett, USAF",
    "link": "vets"
  },
  {
    "text": "Putting peoples lives at danger is ridiculous. To allow companies to throttle service when most needed is unfathomable.",
    "source":"Rachel  Nicodemus, EMT",
    "link": "fr"
  },
  {
    "text": "Net neutrality is essential for a healthy democracy and to enable healthy economic  competition.  My business relies on making our information and services easily available online.  I urge you to support net neutrality at this crucial time.",
    "source": "Susan Henning, Advance Physical Therapy",
    "link": "biz"
  },
  {
    "text": "Corporate influence in Congress has corrupted the values I lost my legs for, and the situation with net neutrality is one of the most blatant examples. This needs to change. That can start by honoring net neutrality.",
    "source": "Adrian Simone, USMC",
    "link": "vets"
  },
  {
    "text": "While I support capitalist ventures, it is a despicable thing to take a basic service that is crucial to ordinary civilians and put limits on it. Subjecting emergency services to data limits creates a guarantee by the service provider that they will be responsible for loss of human life and damage to property.",
    "source":"Thomas Frost, National Guard",
    "link": "fr"
  },
  {
    "text": "Net neutrality is very important for our company and we will only stand behind public officials who stand for net neutrality.",
    "source": "Cote Licciardi, RAM Computer Repair",
    "link": "biz"
  },
  {
    "text": "We need open access to the internet... The private sector did not create the internet... they need to keep their hands and profit seeking off the need. we need open communication without interference!",
    "source": "Thomas Unthank, Army | Signal Corp",
    "link": "vets"
  },
  {
    "text": "Net Neutrality isn't just for emergency responders but for all who use rely on the internet for up to date news and emergency notifications. More and more individuals only have cell phones for communication rather just landlines. The internet needs to be classified as a public utility, clear and simple.",
    "source":"Donavon Gray, Firefighter",
    "link": "fr"
  },
  {
    "text": "I have a life coaching business.  My husband has 2 graphic design start-up companies.  We don't make a full living between us at this time.  It would kill both our struggling businesses if we had to compete for broadband space.",
    "source": "Cheryn English, Creative Life Strategies",
    "link": "biz"
  },
  {
    "text": "I wore the uniform of my country for nearly 24 years and never intended for the benefits of that service to be limited to wealthy fellow citizens.",
    "source": "Larry Holman",
    "link": "vets"
  },
  {
    "text": "This is necessary not only for our safety, but our freedom of speech.",
    "source":"John Fuller, Firefighter",
    "link": "fr"
  },
  {
    "text": "My farm depends on an open internet for advertising. We could never afford to compete with big Agriculture firms in paying for a fast lane.",
    "source": "Polly Matzinger, Ambling Brook Farm",
    "link": "biz"
  },
  {
    "text": "Vietnam-Era Hospital Corpsman who believes open access to information and a variety of viewpoints is essential to true democracy.",
    "source": "David Casker, Navy",
    "link": "vets"
  },
  {
    "text": "Free speech and a healthy democracy necessitates an open internet.   As a public servant and defender of my community, I call on the FCC and Congress to protect and preserve net neutrality for all Americans.",
    "source":"Warren  Goodwin, Firefighter / EMT",
    "link": "fr"
  },
  {
    "text": "There's no excuse at this late date to be \"undecided\" about net neutrality. Everyone deserves to have fair access to the internet without worrying about censorship, propaganda, throttling and having to pay even more for speed and access. Are you in support of a real democracy and free speech?",
    "source": "Barbara Magnuson, Pronghorn Wildlife Photography",
    "link": "biz"
  },
  {
    "text": "You’re constantly putting money in pockets that don’t struggle and taking more and more from pockets who do.  This is another example.  Striking down net neutrality is going to allow money hungry giants to continue to feed on hard working Americans.  It might even hurt those who are trying to further their education.  I support my President, but I do not support all his decisions and this is one of those I don’t.",
    "source": "Andy Klotz, Army",
    "link": "vets"
  },
  {
    "text": "We are neglected enough within the system to also be the focus of corporate greed. \r\nIt's beyond insulting in an already tough enough field",
    "source":"Leandro Banchero, EMT",
    "link": "fr"
  },
  {
    "text": "I rely on my access to the internet to be able to manage my business. This involves both uploading and downloading data. The repeal to net neutrality inhibits this tremendously and I am now spending more per month to do the same thing I've been doing for years.",
    "source": "Jon Stump, Jon Stump Photography",
    "link": "biz"
  },
  {
    "text": "As a U.S. veteran, the freedom of the Internet has meant everything to me.\nIt belongs to everyone in the form it started. Some gave all, and some served longer but at 21+ years I would not want it tampered with by the politicians, the FCC and big business billionaire companies that paid them to disrupt and/or take away one more of the freedoms that we enjoy as United States citizens.",
    "source": "Eric Bollin, Army",
    "link": "vets"
  },
  {
    "text": "911 medic in Portland, OR. I stand with net neutrality and will vote against any and every political figure who does not.",
    "source":"Joshua Prull, Paramedic",
    "link": "fr"
  },
  {
    "text": "As a new and small company, we support NN so that we can give readers the same level of access to our website as the large companies in our industry can. Without NN, we are vulnerable to having large companies pay their way while smaller companies like us get left behind.",
    "source": "Daniel Eagen, The World's Empire, LLC.",
    "link": "biz"
  }
]
